Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.88/PIC32CM-JH01/svd/PIC32CM5164JH01064.svd
            <register>
               <name>INTFLAG</name>
               <description>Interrupt Flag Status and Clear</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>READY</name>
                     <description>NVM Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>READYSelect</name>
                        <enumeratedValue>
                           <name>Val_0</name>
                           <description>The NVM controller is busy programming or erasing.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Val_1</name>
                           <description>The NVM controller is ready to accept a new command</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ERROR</name>
                     <description>Error</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ERRORSelect</name>
                        <enumeratedValue>
                           <name>Val_0</name>
                           <description>No errors have been received since the last clear</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Val_1</name>
                           <description>At least one error has occurred since the last clear</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SERR</name>
                     <description>Single Bit Error Detection Flag</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DERR</name>
                     <description>Double bit Error detection flag</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLASHERR</name>
                     <description>FLASH Err</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLTCAP</name>
                     <description>Fault Capture Interrupt</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUS</name>
               <description>Status</description>
               <addressOffset>0x18</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>PRM</name>
                     <description>Power Reduction Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOAD</name>
                     <description>NVM Page Buffer Active Loading</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PROGE</name>
                     <description>Programming Error Status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCKE</name>
                     <description>Lock Error Status</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NVME</name>
                     <description>NVM Error</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SB</name>
                     <description>Security Bit Status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADDR</name>
               <description>Address</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>NVM Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>22</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LOCK</name>
               <description>Lock Section</description>
               <addressOffset>0x20</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>LOCK</name>
                     <description>Region Lock Bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PBLDATA0</name>
               <description>Page Buffer Load Data 0</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>PBLDATA</name>
                     <description>Page Buffer Load Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PBLDATA1</name>
               <description>Page Buffer Load Data 1</description>
               <addressOffset>0x2C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>PBLDATA</name>
                     <description>Page Buffer Load Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ECCCTRL</name>
               <description>ECC control</description>
               <addressOffset>0x80</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>ECCDIS</name>
                     <description>FLASH ECC Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ECCDISSelect</name>
                        <enumeratedValue>
                           <name>En</name>
                           <description>Flash ECC is Enabled</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Dis</name>
                           <description>Flash ECC is Not Enabled, once written to 1 by user ECC can only be re-enabled only by a reset</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ECCDFDIS</name>
                     <description>Data Flash ECC Disable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ECCDFDISSelect</name>
                        <enumeratedValue>
                           <name>En</name>
                           <description>Data Flash ECC is Enabled</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Dis</name>
                           <description>Data Flash ECC is Not Enabled, once written to 1 by user ECC can only be re-enabled only by a reset</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SECCNT</name>
                     <description>Flash SEC Count</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLTCTRL</name>
               <description>Fault injection control</description>
               <addressOffset>0x84</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>FLTRST</name>
                     <description>Fault reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>FLTRSTSelect</name>
                        <enumeratedValue>
                           <name>Val_0</name>
                           <description>No Effect</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Val_1</name>
                           <description>Resets all FLT SFR bits. {FLTCTRL, FFLTPTR, FFLTADR, FFLTCAP, FFLTPAR, FFLTSYN}</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FLTEN</name>
                     <description>Fault Injection Enabled</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>FLTENSelect</name>
                        <enumeratedValue>
                           <name>Dis</name>
                           <description>Disables the Write/Read fault injection</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>En</name>
                           <description>Enables the Write/Read fault injection to occur selected by FLTMD</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FLTMD</name>
                     <description>Fault Mode Control</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>FLTMDSelect</name>
                        <enumeratedValue>
                           <name>Val_0</name>
                           <description>Fault Injection Disabled</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Val_2</name>
                           <description>Fault Capture Mode Enabled (Capture the address (in FFLTCAP) and Syndrome in (FFLTSYND))</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Val_4</name>
                           <description>Single Fault Injection (at bit selected by FLT1PTR) for Reads</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Val_5</name>
                           <description>Double Fault Injection (uses FLT1PTR and FLT2PTR) for Reads</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Val_6</name>
                           <description>Single Fault Injection (at bit selected by FLT1PTR) for Writes</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Val_7</name>
                           <description>Double Fault Injection (uses FLT1PTR and FLT2PTR) for Writes</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>FFLTPTR</name>
               <description>Fault injection pointer</description>
               <addressOffset>0x88</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FLT1PTR</name>
                     <description>Fault Injection Pointer 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>FLT2PTR</name>
                     <description>Fault Injection pointer 2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FFLTADR</name>
               <description>Fault injection address</description>
               <addressOffset>0x8C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FLTADR</name>
                     <description>Fault Injection Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FFLTCAP</name>
               <description>Fault error capture addr</description>
               <addressOffset>0x90</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FLTADR</name>
                     <description>Fault Capture Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FFLTPAR</name>
               <description>Fault parity</description>
               <addressOffset>0x94</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SECIN</name>
                     <description>Single Error Parity Bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>SECOUT</name>
                     <description>The Calculated Single Error Parity Bits</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FFLTSYN</name>
               <description>Fault ECC syndrome</description>
               <addressOffset>0x98</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SECSYN</name>
                     <description>Single Error Syndrome</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>DERRSERR</name>
                     <description>Double Error detected, Single error corrected</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DBGCTRL</name>
               <description>Debug control</description>
               <addressOffset>0x9C</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>DBGECC</name>
                     <description>ECC errors from debugger reads are</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>DBGECCSelect</name>
                        <enumeratedValue>
                           <name>VAL_0</name>
                           <description>Corrected, INTFLAG is not updated and FLT logic is not updated</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VAL_1</name>
                           <description>Not corrected, INTFLAG is not updated, and FLT logic is not updated</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VAL_2</name>
                           <description>Corrected, INTFLAG is updated and FLT logic operates as setup</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VAL_3</name>
                           <description>Not corrected, INTFLAG is not updated, and FLT logic is not updated</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
