Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.88/PIC32CM-JH01/svd/PIC32CM5164JH01064.svd
               <register>
                  <name>INTFLAG</name>
                  <description>MODE1 Interrupt Flag Status and Clear</description>
                  <addressOffset>0xC</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>PER0</name>
                        <description>Periodic Interval 0</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PER1</name>
                        <description>Periodic Interval 1</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PER2</name>
                        <description>Periodic Interval 2</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PER3</name>
                        <description>Periodic Interval 3</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PER4</name>
                        <description>Periodic Interval 4</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PER5</name>
                        <description>Periodic Interval 5</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PER6</name>
                        <description>Periodic Interval 6</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PER7</name>
                        <description>Periodic Interval 7</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CMP0</name>
                        <description>Compare 0</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CMP1</name>
                        <description>Compare 1</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OVF</name>
                        <description>Overflow</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DBGCTRL</name>
                  <description>Debug Control</description>
                  <addressOffset>0xE</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>DBGRUN</name>
                        <description>Run During Debug</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>SYNCBUSY</name>
                  <description>MODE1 Synchronization Busy Status</description>
                  <addressOffset>0x10</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>Software Reset Bit Busy</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>Enable Bit Busy</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FREQCORR</name>
                        <description>FREQCORR Register Busy</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>COUNT</name>
                        <description>COUNT Register Busy</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PER</name>
                        <description>PER Register Busy</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>COMP0</name>
                        <description>COMP 0 Register Busy</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>COMP1</name>
                        <description>COMP 1 Register Busy</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>COUNTSYNC</name>
                        <description>Count Synchronization Enable Bit Busy</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>GP0</name>
                        <description>General Purpose 0 Register Busy</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>GP1</name>
                        <description>General Purpose 1 Register Busy</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>FREQCORR</name>
                  <description>Frequency Correction</description>
                  <addressOffset>0x14</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>VALUE</name>
                        <description>Correction Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                     <field>
                        <name>SIGN</name>
                        <description>Correction Sign</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>COUNT</name>
                  <description>MODE1 Counter Value</description>
                  <addressOffset>0x18</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>COUNT</name>
                        <description>Counter Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>PER</name>
                  <description>MODE1 Counter Period</description>
                  <addressOffset>0x1C</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>PER</name>
                        <description>Counter Period</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <dim>2</dim>
                  <dimIncrement>2</dimIncrement>
                  <name>COMP[%s]</name>
                  <description>MODE1 Compare n Value</description>
                  <addressOffset>0x20</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>COMP</name>
                        <description>Compare Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <dim>2</dim>
                  <dimIncrement>4</dimIncrement>
                  <name>GP[%s]</name>
                  <description>General Purpose</description>
                  <addressOffset>0x40</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>GP</name>
                        <description>General Purpose</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <cluster>
               <name>MODE2</name>
               <description>Clock/Calendar with Alarm</description>
               <alternateCluster>MODE0</alternateCluster>
               <headerStructName>RtcMode2</headerStructName>
               <addressOffset>0x0</addressOffset>
               <register>
                  <name>CTRLA</name>
                  <description>MODE2 Control A</description>
                  <addressOffset>0x0</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>Software Reset</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MODE</name>
                        <description>Operating Mode</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>MODESelect</name>
                           <enumeratedValue>
                              <name>COUNT32</name>
                              <description>Mode 0: 32-bit Counter</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>COUNT16</name>
                              <description>Mode 1: 16-bit Counter</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CLOCK</name>
                              <description>Mode 2: Clock/Calendar</description>
                              <value>2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>CLKREP</name>
                        <description>Clock Representation</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MATCHCLR</name>
                        <description>Clear on Match</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PRESCALER</name>
                        <description>Prescaler</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>4</bitWidth>
                        <enumeratedValues>
                           <name>PRESCALERSelect</name>
                           <enumeratedValue>
                              <name>OFF</name>
                              <description>CLK_RTC_CNT = GCLK_RTC/1</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV1</name>
                              <description>CLK_RTC_CNT = GCLK_RTC/1</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV2</name>
                              <description>CLK_RTC_CNT = GCLK_RTC/2</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV4</name>
                              <description>CLK_RTC_CNT = GCLK_RTC/4</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV8</name>
                              <description>CLK_RTC_CNT = GCLK_RTC/8</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV16</name>
                              <description>CLK_RTC_CNT = GCLK_RTC/16</description>
                              <value>0x5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV32</name>
                              <description>CLK_RTC_CNT = GCLK_RTC/32</description>
                              <value>0x6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV64</name>
                              <description>CLK_RTC_CNT = GCLK_RTC/64</description>
                              <value>0x7</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV128</name>
                              <description>CLK_RTC_CNT = GCLK_RTC/128</description>
                              <value>0x8</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV256</name>
                              <description>CLK_RTC_CNT = GCLK_RTC/256</description>
                              <value>0x9</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV512</name>
                              <description>CLK_RTC_CNT = GCLK_RTC/512</description>
                              <value>0xA</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV1024</name>
                              <description>CLK_RTC_CNT = GCLK_RTC/1024</description>
                              <value>0xB</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>CLOCKSYNC</name>
                        <description>Clock Read Synchronization Enable</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CTRLB</name>
                  <description>MODE2 Control B</description>
                  <addressOffset>0x2</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>GP0EN</name>
                        <description>General Purpose 0 Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>EVCTRL</name>
                  <description>MODE2 Event Control</description>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>PEREO0</name>
                        <description>Periodic Interval 0 Event Output Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PEREO1</name>
                        <description>Periodic Interval 1 Event Output Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PEREO2</name>
                        <description>Periodic Interval 2 Event Output Enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PEREO3</name>
                        <description>Periodic Interval 3 Event Output Enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PEREO4</name>
                        <description>Periodic Interval 4 Event Output Enable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PEREO5</name>
                        <description>Periodic Interval 5 Event Output Enable</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PEREO6</name>
                        <description>Periodic Interval 6 Event Output Enable</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PEREO7</name>
                        <description>Periodic Interval 7 Event Output Enable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ALARMEO0</name>
                        <description>Alarm 0 Event Output Enable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OVFEO</name>
                        <description>Overflow Event Output Enable</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PERDEO</name>
                        <description>Periodic Interval Daily Event Output Enable</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
